<template>
  <div class="about-samp">
    <div class="about-samp-container">
      <div class="about-samp-inner">
        <h1>San Andreas Multiplayer (скорочено SA:MP)</h1>
        <p>San Andreas Multiplayer (скорочено SA:MP) — безкоштовна багатокористувацька модифікація для відеогри Grand Theft Auto: San Andreas у версії для Windows з закритим початковим кодом. Розробляється командою «SA-MP Team» на добровільній основі, провідними програмістами проекту є дві особи з нікнеймами Kalcor (Kye) і Spookie.</p>
        <h2>Історія</h2>
        <h3>Vice City Multiplayer</h3>
        <p>За основу модифікації було використано аналогічну модифікацію попередньої гри серії, Grand Theft Auto: Vice City під назвою Vice City Multiplayer, випущену у квітні 2005 року. Команда творців складалася з кількох осіб, відомих у спільноті модифікаторів Grand Theft Auto, на чолі з kyeman (Kye) (наразі відомий як Kalcor) — значущою особою у спільноті модобудівничих GTA. Надаючи знімки екрана та відео, які демонстрували плин розробки (що відбувалася достатньо швидко), модифікація набула загального визнання серед GTA-спільноти та з невеликим форумом залучила близько 120 користувачів перед переїздом на новий хостинг. </p>
        <p>Після ряду публічних бета-тестів, які набули величезної популярності (багатьом навіть доводилося чекати звільнення місць на бета-серверах), Vice City Multiplayer було нарешті випущено і майже відразу оновлено до версії 0.1d, до кінця вже маючи відкритий початковий код. Цей код було використано іншою командою розробників для продовження розвитку VC-MP (цей проект досі розвивається і наразі має версію 0.4), а команда kyeman'а (Kalcor'a) розпочала розробку SA-MP. Крім того, теперішні розробники VC-MP роблять багатокористувацьку гру як для оригінальної гри Grand Theft Auto: Vice City, так і для модифікації, що переносить місто Ліберті-Сіті на рушій гри. </p>
        <h3>San Andreas Multiplayer</h3>
        <p>Розробка SA-MP привернула великий інтерес шанувальників ігор серії GTA. У квітні 2006 року розділу на форумі GTAForums.com стало недостатньо, і розробники вирішили відкрити власний форум. У кінці березня розробка вже була повноцінним мультиплеєром і, після деяких закритих бета-тестів, у квітні-травні було проведено три публічних бета-тести. За кілька годин після третього бета-тесту, 10 травня 2006 року kyeman (Kalcor) заявив, що проект повністю готовий до випуску. Однак у релізі виявилося досить багато багів, і за кілька днів було випущено оновлення до версії 0.1b. Після цього користувачі продовжили вивчати мову програмування Pawn і створювати різноманітні ігрові режими, а самі розробники зникли на деякий час. Лише наприкінці червня в повідомленні на своєму блозі вони заявили, що розробка все ще триває, хоча в них дуже мало часу. Розробники продемонстрували кілька скріншотів можливості додавання об'єктів на карту. Ходили чутки, що незабаром вийде версія 0.1c, але до вересня нової інформації від розробників не надходило. Лише наприкінці вересня невелике оновлення блогу свідчило, що розробка триває, і було представлено невеликий список нововведень.</p>
        <p>2 жовтня 2006 року з'явилася інформація про те, що готується нова версія 0.2. Інформацію було підкріплено великим списком нововведень і відеороликом, що показує безліч нових можливостей. Це викликало хвилю інтересу серед шанувальників SA-MP, яких тоді налічувалося вже кілька тисяч по всьому світу. Однак після цього нової інформації не було кілька місяців. Розробка дуже затягнулася і, після декількох невеликих оновлень, 9 березня 2007 року розробники представили на своєму блозі прев'ю версії 0.2 з великим списком змін і двома відеороликами, знятими на закритих бета-тестах. Також було оголошено, що незабаром буде проведено кілька публічних бета-тестів. До початку першого публічного бета-тесту пройшов іще місяць. До того часу ажіотаж з приводу нової версії досяг неймовірно великого рівня, і розробники вирішили не оголошувати про бета-тестування на своєму блозі. Натомість напередодні Великодня, 8 квітня, на сайті розробників з'явилася пасхалка у вигляді посилання, яке через кілька перенаправлень виводило користувача на IRC-канал бета-тестування, що розпочалося ввечері того ж дня. Спочатку було відкрито один сервер на 100 місць, але незабаром було запущено ще декілька серверів. Це бета-тестування тривало до 11 квітня. Наступний бета-тест пройшов лише за місяць і тривав кілька годин. Метою його було протестувати можливість сервера витримувати навантаження до 200 гравців. Після цього на блозі kyeman (Kalcor) оголосив, що буде проведено ще щонайменше два бета-тести. Наприкінці травня пройшов перший з них, після чого у блозі було оголошено деякі нововведення. 3 червня 2007 року розробники випустили RC-версію клієнта і сервери 0.2 на чотири місця, тим самим дозволивши користувачам розпочати розробку й оновлення режимів для нової версії. Протягом наступних двох тижнів було випущено ще два реліз-кандидати, і після четвертого бета-тестування, що перейшло у п'яте, 20 червня 2007 року SA-MP 0.2 була офіційно випущена. Але розробка не завершилася, і за кілька днів уже було випущено версію 0.2.1 з деякими оновленнями та виправленнями.</p>
        <p>24 червня 2007 несподівано для користувачів команда SA-MP оголосила на своєму сайті, що припиняє роботу над модом і будь-яку його підтримку, бо не мають більше сил і можливостей боротися з людьми, які, не боячись нічого, розробляють чіти та експлойти для SA-MP. Миттєво в Інтернеті була організована петиція з вимогою до розробників повернутися до роботи над модом. За кілька годин під петицією підписалося кілька тисяч чоловік. Це спрацювало, і менше ніж за добу роботу всіх серверів SA-MP було відновлено. Наступного дня було випущено оновлення для сервера, що закриває експлойт, попереджує падіння серверу і містить вбудований античіт SAC (англ. SA-MP Anti-Cheat), що не дозволяє гравцям заходити у гру з чітерськими трейнерами або плаґінами для SA-MP. За місяць, 29 серпня 2007 року, після двох відкритих бета-тестів було випущено версію 0.2.2 і було оголошено про початок роботи над версією 0.3. А наступного дня, 30 серпня, було випущено клієнт SA-MP версії 0.2.2 R2, що усуває кілька помилок, знайдених у версії 0.2.2 відразу ж після релізу.</p>
        <p>13 травня 2008 року, несподівано для всіх, команда SA-MP закрила сайт і оголосила про кінець розробки SA-MP. За кілька днів сайт був відновлено, і на ньому з'явилася новина про закінчення розробки SA-MP. Вночі 23 травня було відновлено форум. 21 червня 2008 року для вирішення проблем з безпекою було випущено версію 0.2.2 R3. Також в оновленні були виправлені деякі баги і збільшено обмеження кількості моделей машин. Оновлення стосувалося лише клієнта.</p>
        <p>20 листопада 2008 року було випущено версію SA-MP 0.2x. Більшість змін не були значними для звичайного гравця, за винятком поліпшення синхронізації та усунення проблем з вильотом клієнта. У вкладці «Internet» сервери версії 0.2.2 більше не з'являються. Більшість серверів переведено на версію SA-MP 0.2x. Також було оголошено про розробку версії SA-MP 0.3. Раніше обіцяну версію SA-MP 0.2.5 випущено не буде.</p>
        <p>14 серпня 2009 року розпочалися публічні бета-тестування SA-MP 0.3. 15 серпня відбулося друге бета-тестування, в якому взяло участь понад 400 гравців. 19 жовтня було випущено фінальну версію 0.3a. Згодом було випущено кілька незначних оновлень в лінійці даної версії. 11 серпня 2010 року розпочалося тестування версії 0.3b, а її випуск відбувся 21 серпня 2010 року. 28 листопада 2010 року до мережі потрапили клієнт і сервер (Windows і Linux) RC2-версії 0.3c.</p>
        <p>На початку 2012 року вийшла версія SA: MP 0.3d. У травні 2012 року вийшов SA: MP 0.3e. На початку 2013 року вийшов клієнт SA: MP 0.3x. 13 лютого 2014 року офіційно вийшли клієнт і сервер 0.3z. 18 січня 2015 року вийшла перша бета-версія SA: MP 0.3.7 RC-1. Розробники урізноманітнили гілку 0.3. До даної версії було внесено значні зміни.</p>
        <p>1 травня 2015 року вийшов SA: MP 0.3.7. 13 липня 2015 року вийшло оновлення для сервера SA: MP 0.3.7 R2. 4 листопада 2017 року вийшла тестова версія SA: MP 0.3.8. 13 січня 2018 року версія SA: MP 0.3.8 була скасована та анонсована нова версія SA: MP 0.3.DL, яка дає можливість розробникам ігрових серверів завантажувати модифікації на сервер (нові моделі персонажів, об'єктів).</p>
        <h2>Ігровий процес</h2>
        <p>Всі ігрові сервери SA-MP відносяться до одного чи кількох жанрів. Найпоширенішими жанрами є:</p>
        <ul>
          <li><span>Дрифт (англ. Drift)</span> — режим, схожий на політ, в якому гравці заробляють очки, контролюючи заноси на спеціально розроблених картах.</li>
          <li><span>Перегони (англ. Race)</span>, беручи участь у яких, необхідно виграти якомога більше коштів.</li>
          <li><span>Рольова гра (англ. Roleplay)</span> — найпопулярніший режим, мета якого полягає в імітуванні реального життя.</li>
          <li><span>Стантрайдинг (англ. Stunt)</span> — додано предмети для виконання акробатичних трюків на транспортних засобах.</li>
          <li><span>Deathmatch</span> — кожен грає сам за себе, мета — вбити якомога більше супротивників.</li>
          <li><span>Freeroam</span> — вільна гра, суміш декількох режимів.</li>
          <li><span>Team Deathmatch</span> — гра ведеться в командах, мета — вбити якомога більше гравців команди-суперниці.</li>
          <li><span>Truck</span> — на сервері присутні лише вантажівки та причепи, мета — розвозити товари вантажівкою та заробити собі на життя.</li>
        </ul>
        <p>Деякі елементи ігрового процесу містять контрольні та початкові точки, бонуси, зброю та різноманітні об'єкти — від рамп до вибухових діжок. Багато онлайн-серверів містять нетипові ігрові режими, що використовують скриптовий рушій, включений до SA-MP. Прикладами можуть бути такі ігрові режими, як Freeroam, де гравці можуть вільно пересуватися картою Сан-Андреаса, чи змагальні режими на кшталт Race, Destruction / Demolition Derby, Team DeathMatch і Fallout, де персонажі гравців опиняються в повітрі на скляній платформі, що раптово падає після показу, гравці мають стрибати шматками платформи, а останній вцілілий виграє. Принцип Fallout подібний до Hay, де гравці мусять вилазити на копиці сіна та бути на першій з них. Останній режим також демонструє, як багато ігрових режимів і скриптів можна створити на скриптовому рушії SAMP із нескінченними можливостями та різновидами.</p>
        <p>Існує багато специфічних жанрів ігор і спільнот, як-от гра ролі з реального життя, класична рольова гра й ігрові спільноти, що пропонують широке розмаїття різних ігрових режимів, іноді разом на одному сервері. Сьогодні середня кількість ігрових серверів Сан-Андреаса в San Andreas Multiplayer сягає понад 4000 з загальною кількістю гравців онлайн 19—23 тис. одночасно.</p>
        <h3>Рольова гра</h3>
        <p>Рольова гра (англ. Role-Playing Game, RPG) — гра, в якій гравці створюють єдину історію з особистостями своїх персонажів. В інших іграх (як-от Metin2[en]) поняття ролі загалом не розуміється. Хоча більшість Інтернет-ігор називається рольовими, вони навіть віддалено не мають з ними нічого спільного. В SA-MP цей термін називається RolePlay. Тому рольові сервери не є окремими «рольовими іграми». GTA San Andreas — багатокористувацька гра за грою.</p>
        <p>Починаючи гру на багатьох серверах, гравець безробітний, але має деякі кошти. Йому потрібно знайти професію та заробити гроші. У грі він зіткнеться з такими поняттями, як «за роллю» (IC), «поза роллю» (OOC) та «суперечить ролі» (NON-RP). Їх значення зазначено нижче:</p>
        <dl>
          <dt>In-Character</dt>
          <dd>Життя не гравця, а його персонажа. Це не гра, в яку він грає, це життя, яким живе його персонаж.</dd>
          <dt>Out-of-Character</dt>
          <dd>Речі поза життям персонажа. Наприклад, речення «Якою клавішею сісти на пасажирське сидіння?» не є рольовим.</dd>
          <dt>NON-RP</dt>
          <dd>Персонаж не зображає реальну людину. Прикладом цього є відкриття вогню, озираючись при цьому.</dd>
          <dt>Суміш</dt>
          <dd>Наприклад, гра позаігрових речей всередині гри.</dd>
          <dt>Метагра</dt>
          <dd>В реальному житті ніхто не знає нічиїх імен до особистого знайомства. У грі персонаж також не повинен знати імен інших. Якщо хтось, не знаючи когось, звертається до нього на ім'я чи іншим чином поводиться так, ніби знає його, це метагра.</dd>
          <dt>Павергра</dt>
          <dd>Порушення балансу та ролі шляхом виконання дій, які неможливо здійснити в реальному житті. Наприклад, взяти будь-який з усіх типів транспортних засобів у грі.</dd>
        </dl>
        <p>Часто використовувані команди на рольових серверах:</p>
        <dl>
          <dt>/b [текст]</dt>
          <dd>Нерольова команда. Тексти можуть читатися на відстані.</dd>
          <dt>/s [текст]</dt>
          <dd>Команда крику. Сказане можна почути на відстані. Рольова команда.</dd>
          <dt>/do [текст]</dt>
          <dd>Використовується для того, щоб показати, доповісти чи нагадати іншим гравцям про те, що відбувається. Рольова команда. Зазвичай використовується, коли ігрової графіки недостатньо.</dd>
          <dt>/me [текст]</dt>
          <dd>Рольова команда, що використовується для позначення власних дій. Відображається, наприклад, як <span>[Ім'я] [текст]</span>. Використовується, коли ігрова графіка не є адекватною. Наприклад, <span>/me дивиться крізь вікно автомобіля</span>, <span>/me загоряється</span>, <span> /me посміхається.</span></dd>
          <dt>/help</dt>
          <dd>Команда, за допомогою якої можна дізнатися про рольові та нерольові команди, а також правила серверу. Зазвичай містить усі команди на сервері.</dd>
        </dl>
          <h2>Можливості</h2>
          <h3>Скриптинг</h3>
          <p>Завдяки скриптовому рушієві мовою Pawn, вбудованому в SA-MP, будь-який користувач із певними знаннями у програмуванні може розробляти власні ігрові режими та фільтрувальні скрипти. Також сьогодні існує велика кількість ігрових режимів у вільному використанні, зокрема багато великих рольових і MMORPG режимів, як-от PEN1:LS, The Godfather і GTO. Pawn дозволяє будь-кому створювати цілі місії в межах ігрового світу GTA San Andreas. Кожний ігровий режим або фільтрувальний скрипт використовується сервером у вигляді окремого файлу. В будь-який момент може бути запущено лише один ігровий режим і не більше 16 фільтрувальних скриптів. Режим, як правило, виконує основні функції ведення ігрового процесу, тоді як фільтрувальні скрипти відповідають за сторонні функції серверу, які можна вмикати та вимикати в будь-який момент без шкоди для ігрового процесу. Втім, таке розділення вельми умовне й нічого не заважає перенести всю функціональність до режиму чи навпаки, до фільтрувальних скрипів. Скриптовий API серверу містить як активні функції, що виконується в певний момент, так і перехоплювачі події, що виконуються автоматично під час певних подій, як-от підключення гравця до серверу, запуск або зупинка режиму тощо.</p>
          <p>Можна розділяти ігровий режим і фільтрувальні скрипти. Попри відсутність систематичних відмінностей між режимом і кодуванням скрипту є важливі подробиці. Під час входу до гри спочатку відкривається перший режим у <span>server.cfg</span>, а лише потім побічні режими. Щойно режим завантажується до папки <span>gamemodes</span>, він записується як <span>gamemode0</span> (без розширення) з <span>server.cfg</span>. Скрипти відокремлюються від фільтрувальних скриптів на основі рядка <span>gl_actions</span>. Якщо замість <span>gamemode0</span> написано <span>gamemode1</span>, скрипти не працюватимуть.</p>
          <p>Файли скриптів є файлами коду, які можна можна додати поза режимом замість додавання до самого режиму. За необхідності їх можна активувати та дезактивувати без вимикання режиму. Це спрямовано на полегшення режиму. Якщо всі файли скриптів вставити до режиму, то їх завантаження та редагування займатиме час.</p>
          <h3>Конфігураційні файли</h3>
          <p>Налаштування модифікації для мережевої гри у Grand Theft Auto: San Andreas під назвою San Andreas Multiplayer (скорочено SA-MP) можливе як на боці сервера, так і на боці клієнта. Перший спосіб налаштувань впливає на всіх гравців певного сервера, тоді як другий — лише на того гравця, який зробив свої налаштування. Відповідно, серверні параметри зберігаються у файлі <span>server.cfg</span>, а клієнтські — у файлі <span>sa-mp.cfg</span>. Формат обох файлів подібний до INI файлів, але дещо спрощений, наприклад, не використовується розподіл параметрів за секціями.</p>
          <h3>Режими</h3>
          <p>Стандартний набір серверу містить декілька простих режимів і фільтрувальних скриптів, які демонструють застосування основних функцій мультиплеєру. Багато поширених сьогодні режимів є тією чи іншою мірою модифікаціями стандартних режимів. До основних ігрових режимів відносяться:</p>
        <dl>
          <dt>Barron або RC Barnstorm</dt>
          <dd>Ігровий режим з метою знищення транспортних засобів з дистанційним керуванням інших гравців.</dd>
          <dt>Grand Larceny (Grandlarc)</dt>
          <dd>Офіційний режим жанру Freeroam, створений SA-MP Team.</dd>
          <dt>Rivershell</dt>
          <dd>Режим жанру Team DeathMatch на річці, розташованій у Сан-Фієрро.</dd>
        </dl>
          <h3>Команди серверу</h3>
          <p>Скриптом режиму задаються ігрові команди, які починаються з символу / та використовуються для полегшення гри, наприклад, <span>/help</span> — допомога, <span>/kill</span>  — самогубство, <span>/stats</span> — статистика. В кожному режимі свої команди, серед яких телепортація, довідка, початок перегонів, створення маркеру, адміністративні команди й інші.</p>
          <h3>Плагіни</h3>
          <p>Починаючи з версії 0.2, мультиплеєр підтримує можливість створення плагінів, які розширюють можливості серверу. Найпопулярнішими є плагіни для роботи з СКБД MySQL, чатами IRC-мережі та розсиланням електронних листів протоколом SMTP.</p>
          <div class="source-link">
            <p>Матеріал було взято з сайту: <a href="https://uk.wikipedia.org/wiki/San_Andreas_Multiplayer">https://uk.wikipedia.org/wiki/San_Andreas_Multiplayer</a></p>
          </div>

      </div>
    </div>
      <SampTable />
  </div>
</template>

<script>
import SampTable from "@/components/SampTable";
export default {
  name: "About_Samp",
  components: {SampTable}
}
</script>

<style scoped>
.about-samp {
  display: flex;
  width: 100%;
  height: 95%;
  margin: 20px;
  flex-direction: row;
  text-decoration: none;
}

.about-samp-container {
  display: flex;
  border-radius: 20px;
  width: 75%;
  background: #09189a;
}

.about-samp-inner {
  display: flex;
  flex-direction: column;
  margin: 10px;
  padding: 20px;
  width: 100%;
  overflow-y: auto;
}

.about-samp-inner h1, h2, h3 {
  text-align: left;
}

.about-samp-inner ul {
  margin-bottom: 0;
  background: #080c74;
  border-radius: 20px;
  padding-right: 20px;
}

.about-samp-inner dl {
  background: #080c74;
  border-radius: 20px;
  padding: 0 20px;
}

.about-samp-inner dt {
  font-weight: bold;
  color: #cbce0a;
}

.about-samp-inner span {
  color: #cbce0a;
  font-weight: bold;
}

.about-samp-inner li::marker {
  color: #FCFF00;
}

.about-samp-inner .source-link p {
  color: gray;
  font-size: 1.2vw;
}

.about-samp-inner .source-link a {
  color: deeppink;
  font-size: 1.2vw;
}

.about-samp-inner .source-link a:hover {
  opacity: 0.8;
}
@media screen and (min-width: 1440px) {
  .about-samp-inner .source-link p {
    font-size: 0.8vw;
  }
  .about-samp-inner .source-link a {
    color: deeppink;
    font-size: 0.8vw;
  }
}
@media screen and (max-width: 988px) {
  .about-samp {
    margin: 0;
    background: none;
  }
}
</style>